# Data Cleaning and Preparation

## Description

### GitHub連結

### Required Datasets

## Required Packages

In [1]:
import numpy as np
import pandas as pd
from numpy import nan as NA
import re

## 7.1 Handling Missing Data

In [2]:
string_data = pd.Series(['aardvark', 'artichoke', np.nan, 'avocado'])
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [3]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [4]:
string_data[0] = None
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

##### NA

| Argument | Description |
| - | - |
| dropna | Filter axis labels based on whether values for each label have missing data, with varying thresholds for how much missing data to tolerate. |
| fillna | Fill in missing data with some value or using an interpolation method such as'ffill'or'bfill'. |
| isnull | Return boolean values indicating which values are missing/NA. |
| notnull | Negation ofisnull. |

### Filtering Out Missing Data

In [5]:
data = pd.Series([1, NA, 3.5, NA, 7])
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [6]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [7]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA],
                     [NA, NA, NA], [NA, 6.5, 3.]])
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [8]:
cleaned = data.dropna()
cleaned

     0    1    2
0  1.0  6.5  3.0

In [9]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [10]:
data[4] = NA
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [11]:
data.dropna(axis=1, how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [12]:
df = pd.DataFrame(np.random.randn(7, 3))

In [13]:
df.iloc[:4, 1] = NA

In [14]:
df.iloc[:2, 2] = NA

In [15]:
df

          0         1         2
0 -0.685573       NaN       NaN
1 -2.205948       NaN       NaN
2 -1.564827       NaN -0.174266
3  0.346201       NaN -0.734329
4 -0.335170 -0.179355  0.205110
5 -0.187853  0.263990 -0.163482
6  0.711858 -0.688219  1.496841

In [16]:
df.dropna()

          0         1         2
4 -0.335170 -0.179355  0.205110
5 -0.187853  0.263990 -0.163482
6  0.711858 -0.688219  1.496841

In [17]:
df.dropna(thresh=2)

          0         1         2
2 -1.564827       NaN -0.174266
3  0.346201       NaN -0.734329
4 -0.335170 -0.179355  0.205110
5 -0.187853  0.263990 -0.163482
6  0.711858 -0.688219  1.496841

### Filling In Missing Data

In [18]:
df.fillna(0)

          0         1         2
0 -0.685573  0.000000  0.000000
1 -2.205948  0.000000  0.000000
2 -1.564827  0.000000 -0.174266
3  0.346201  0.000000 -0.734329
4 -0.335170 -0.179355  0.205110
5 -0.187853  0.263990 -0.163482
6  0.711858 -0.688219  1.496841

In [19]:
df.fillna({1: 0.5, 2: 0})

          0         1         2
0 -0.685573  0.500000  0.000000
1 -2.205948  0.500000  0.000000
2 -1.564827  0.500000 -0.174266
3  0.346201  0.500000 -0.734329
4 -0.335170 -0.179355  0.205110
5 -0.187853  0.263990 -0.163482
6  0.711858 -0.688219  1.496841

In [20]:
_ = df.fillna(0, inplace=True)
df

          0         1         2
0 -0.685573  0.000000  0.000000
1 -2.205948  0.000000  0.000000
2 -1.564827  0.000000 -0.174266
3  0.346201  0.000000 -0.734329
4 -0.335170 -0.179355  0.205110
5 -0.187853  0.263990 -0.163482
6  0.711858 -0.688219  1.496841

In [21]:
df = pd.DataFrame(np.random.randn(6, 3))

In [22]:
df.iloc[2:, 1] = NA

In [23]:
df.iloc[4:, 2] = NA

In [24]:
df

          0         1         2
0  0.793161 -0.736340  2.322660
1 -0.532862 -0.938612 -1.110103
2 -0.139447       NaN -0.238959
3  0.836497       NaN -0.162489
4  0.472494       NaN       NaN
5  0.137400       NaN       NaN

In [25]:
df.fillna(method='ffill')

          0         1         2
0  0.793161 -0.736340  2.322660
1 -0.532862 -0.938612 -1.110103
2 -0.139447 -0.938612 -0.238959
3  0.836497 -0.938612 -0.162489
4  0.472494 -0.938612 -0.162489
5  0.137400 -0.938612 -0.162489

In [26]:
df.fillna(method='ffill', limit=2)

          0         1         2
0  0.793161 -0.736340  2.322660
1 -0.532862 -0.938612 -1.110103
2 -0.139447 -0.938612 -0.238959
3  0.836497 -0.938612 -0.162489
4  0.472494       NaN -0.162489
5  0.137400       NaN -0.162489

In [27]:
data = pd.Series([1., NA, 3.5, NA, 7])

In [28]:
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

##### fillna function arguments

| Argument | Description |
| - | - |
| value | Scalar value or dict-like object to use to fill missing values |
| method | Interpolation; by default'ffill'if function called with no other arguments |
| axis | Axis to fill on; defaultaxis=0 |
| inplace | Modify the calling object without producing a copy |
| limit | For forward and backward filling, maximum number of consecutive periods to fill |

## 7.2 Data Transformation

### Removing Duplicates

In [29]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],
                     'k2': [1, 1, 2, 3, 3, 4, 4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [30]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [31]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [32]:
data['v1'] = range(7)

In [33]:
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [34]:
data.drop_duplicates(['k1', 'k2'], keep='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

### Transforming Data Using a Function or Mapping

In [35]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon',
                              'Pastrami', 'corned beef', 'Bacon',
                              'pastrami', 'honey ham', 'nova lox'],
                     'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [36]:
meat_to_animal = {
    'bacon': 'pig',
    'pulled pork': 'pig',
    'pastrami': 'cow',
    'corned beef': 'cow',
    'honey ham': 'pig',
    'nova lox': 'salmon'
}

In [37]:
lowercased = data['food'].str.lower()
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [38]:
data['animal'] = lowercased.map(meat_to_animal)
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [39]:
data['food'].map(lambda x: meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

### Replacing Values

In [40]:
data = pd.Series([1., -999, 2., -999., -1000., 3.])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [41]:
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [42]:
data.replace([-999, -1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [43]:
data.replace([-999, -1000], [np.nan, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [44]:
data.replace({-999: np.nan, -1000: 0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

### Renaming Axis Indexes

In [45]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
                    index=['Ohio', 'Colorado', 'New York'],
                    columns=['one', 'two', 'three', 'four'])

In [46]:
transform = lambda x: x[:4].upper()

In [47]:
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [48]:
data.index = data.index.map(transform)

In [49]:
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [50]:
data.rename(index=str.title, columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [51]:
data.rename(index={'OHIO': 'INDIANA'},
            columns={'three': 'peekaboo'})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

In [52]:
data.rename(index={'OHIO': 'INDIANA'}, inplace=True)

### Discretization and Binning

In [53]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [54]:
bins = [18, 25, 35, 60, 100]

In [55]:
cats = pd.cut(ages, bins)
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [56]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [57]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]],
              closed='right',
              dtype='interval[int64]')

In [58]:
pd.value_counts(cats)

(18, 25]     5
(25, 35]     3
(35, 60]     3
(60, 100]    1
dtype: int64

In [59]:
pd.cut(ages, [18, 26, 36, 61, 100], right=False)

[[18, 26), [18, 26), [18, 26), [26, 36), [18, 26), ..., [26, 36), [61, 100), [36, 61), [36, 61), [26, 36)]
Length: 12
Categories (4, interval[int64]): [[18, 26) < [26, 36) < [36, 61) < [61, 100)]

In [60]:
group_names = ['Youth', 'YoungAdult', 'MiddleAged', 'Senior']

In [61]:
pd.cut(ages, bins, labels=group_names)

['Youth', 'Youth', 'Youth', 'YoungAdult', 'Youth', ..., 'YoungAdult', 'Senior', 'MiddleAged', 'MiddleAged', 'YoungAdult']
Length: 12
Categories (4, object): ['Youth' < 'YoungAdult' < 'MiddleAged' < 'Senior']

In [62]:
data = np.random.rand(20)

In [63]:
pd.cut(data, 4, precision=2)

[(0.25, 0.5], (0.5, 0.74], (0.74, 0.99], (0.0015, 0.25], (0.74, 0.99], ..., (0.5, 0.74], (0.5, 0.74], (0.74, 0.99], (0.0015, 0.25], (0.25, 0.5]]
Length: 20
Categories (4, interval[float64]): [(0.0015, 0.25] < (0.25, 0.5] < (0.5, 0.74] < (0.74, 0.99]]

In [64]:
data = np.random.randn(1000)

In [65]:
cats = pd.qcut(data, 4)
cats

[(-0.622, 0.0308], (-0.622, 0.0308], (0.0308, 0.675], (-3.5269999999999997, -0.622], (-3.5269999999999997, -0.622], ..., (0.675, 3.405], (0.675, 3.405], (0.0308, 0.675], (0.675, 3.405], (-0.622, 0.0308]]
Length: 1000
Categories (4, interval[float64]): [(-3.5269999999999997, -0.622] < (-0.622, 0.0308] < (0.0308, 0.675] < (0.675, 3.405]]

In [66]:
pd.value_counts(cats)

(-3.5269999999999997, -0.622]    250
(-0.622, 0.0308]                 250
(0.0308, 0.675]                  250
(0.675, 3.405]                   250
dtype: int64

In [67]:
pd.qcut(data, [0, 0.1, 0.5, 0.9, 1.])

[(-1.32, 0.0308], (-1.32, 0.0308], (0.0308, 1.279], (-3.5269999999999997, -1.32], (-1.32, 0.0308], ..., (0.0308, 1.279], (1.279, 3.405], (0.0308, 1.279], (0.0308, 1.279], (-1.32, 0.0308]]
Length: 1000
Categories (4, interval[float64]): [(-3.5269999999999997, -1.32] < (-1.32, 0.0308] < (0.0308, 1.279] < (1.279, 3.405]]

### Detecting and Filtering Outliers

In [68]:
data = pd.DataFrame(np.random.randn(1000, 4))

In [69]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.040410    -0.008115     0.009459    -0.075400
std       0.985528     1.040243     1.005356     0.982187
min      -3.295628    -4.054145    -2.872391    -3.436392
25%      -0.686459    -0.710778    -0.694679    -0.754059
50%       0.020222    -0.018779     0.005265    -0.039124
75%       0.603009     0.709717     0.680447     0.590380
max       3.192193     3.163410     3.164618     2.689175

In [70]:
col = data[2]

In [71]:
col[np.abs(col) > 3]

815    3.164618
Name: 2, dtype: float64

In [72]:
data[(np.abs(data) > 3).any(1)]

            0         1         2         3
10   3.192193 -0.331225 -0.365144 -1.407603
75  -0.145667 -4.054145  0.603658 -1.940552
427  0.925568  3.163410  0.870429  0.458339
815  1.438847  1.324959  3.164618 -1.312431
896 -3.295628 -0.414855 -2.354986 -3.436392

In [73]:
data[np.abs(data) > 3] = np.sign(data) * 3

In [74]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.040306    -0.007224     0.009295    -0.074963
std       0.983982     1.036180     1.004853     0.980788
min      -3.000000    -3.000000    -2.872391    -3.000000
25%      -0.686459    -0.710778    -0.694679    -0.754059
50%       0.020222    -0.018779     0.005265    -0.039124
75%       0.603009     0.709717     0.680447     0.590380
max       3.000000     3.000000     3.000000     2.689175

In [75]:
np.sign(data).head()

     0    1    2    3
0  1.0 -1.0 -1.0 -1.0
1 -1.0 -1.0  1.0 -1.0
2  1.0  1.0  1.0  1.0
3 -1.0  1.0  1.0 -1.0
4 -1.0 -1.0  1.0  1.0

### Permutation and Random Sampling

In [76]:
df = pd.DataFrame(np.arange(5 * 4).reshape((5, 4)))

In [77]:
sampler = np.random.permutation(5)
sampler

array([0, 1, 4, 3, 2])

In [78]:
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [79]:
df.take(sampler)

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
4  16  17  18  19
3  12  13  14  15
2   8   9  10  11

In [80]:
df.sample(n=3)

    0   1   2   3
1   4   5   6   7
2   8   9  10  11
4  16  17  18  19

In [81]:
choices = pd.Series([5, 7, -1, 6, 4])

In [82]:
draws = choices.sample(n=10, replace=True)
draws

4    4
0    5
4    4
3    6
3    6
1    7
4    4
1    7
1    7
3    6
dtype: int64

### Computing Indicator/Dummy Variables

In [83]:
df = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'],
                   'data1': range(6)})

In [84]:
pd.get_dummies(df['key'])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [85]:
dummies = pd.get_dummies(df['key'], prefix='key')

In [86]:
df_with_dummy = df[['data1']].join(dummies)
df_with_dummy

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

In [140]:
mnames = ['movie_id', 'title', 'genres']
movies = pd.read_table('src/dat/movies.dat', sep='::',
                       header=None, names=mnames,engine='python')

In [88]:
movies[:10]

   movie_id                               title                        genres
0         1                    Toy Story (1995)   Animation|Children's|Comedy
1         2                      Jumanji (1995)  Adventure|Children's|Fantasy
2         3             Grumpier Old Men (1995)                Comedy|Romance
3         4            Waiting to Exhale (1995)                  Comedy|Drama
4         5  Father of the Bride Part II (1995)                        Comedy
5         6                         Heat (1995)         Action|Crime|Thriller
6         7                      Sabrina (1995)                Comedy|Romance
7         8                 Tom and Huck (1995)          Adventure|Children's
8         9                 Sudden Death (1995)                        Action
9        10                    GoldenEye (1995)     Action|Adventure|Thriller

In [89]:
all_genres = []

In [90]:
for x in movies.genres:
    all_genres.extend(x.split('|'))

In [91]:
genres = pd.unique(all_genres)
genres

array(['Animation', "Children's", 'Comedy', 'Adventure', 'Fantasy',
       'Romance', 'Drama', 'Action', 'Crime', 'Thriller', 'Horror',
       'Sci-Fi', 'Documentary', 'War', 'Musical', 'Mystery', 'Film-Noir',
       'Western'], dtype=object)

In [141]:
zero_matrix = np.zeros((len(movies), len(genres)))
zero_matrix

array([[0., 0., 0., ..., 0., 0., 0.],
       [0., 0., 0., ..., 0., 0., 0.],
       [0., 0., 0., ..., 0., 0., 0.],
       ...,
       [0., 0., 0., ..., 0., 0., 0.],
       [0., 0., 0., ..., 0., 0., 0.],
       [0., 0., 0., ..., 0., 0., 0.]])

In [142]:
dummies = pd.DataFrame(zero_matrix, columns=genres)

In [143]:
gen = movies.genres[0]
gen.split('|')

['Animation', "Children's", 'Comedy']

In [95]:
dummies.columns.get_indexer(gen.split('|'))

array([0, 1, 2], dtype=int64)

In [96]:
for i, gen in enumerate(movies.genres):
    indices = dummies.columns.get_indexer(gen.split('|'))
    dummies.iloc[i, indices] = 1

In [97]:
movies_windic = movies.join(dummies.add_prefix('Genre_'))

In [98]:
movies_windic.iloc[0]

movie_id                                       1
title                           Toy Story (1995)
genres               Animation|Children's|Comedy
Genre_Animation                              1.0
Genre_Children's                             1.0
Genre_Comedy                                 1.0
Genre_Adventure                              0.0
Genre_Fantasy                                0.0
Genre_Romance                                0.0
Genre_Drama                                  0.0
Genre_Action                                 0.0
Genre_Crime                                  0.0
Genre_Thriller                               0.0
Genre_Horror                                 0.0
Genre_Sci-Fi                                 0.0
Genre_Documentary                            0.0
Genre_War                                    0.0
Genre_Musical                                0.0
Genre_Mystery                                0.0
Genre_Film-Noir                              0.0
Genre_Western                                0.0
Name: 0, dtype: object

In [99]:
np.random.seed(12345)

In [100]:
values = np.random.rand(10)
values

array([0.92961609, 0.31637555, 0.18391881, 0.20456028, 0.56772503,
       0.5955447 , 0.96451452, 0.6531771 , 0.74890664, 0.65356987])

In [101]:
bins = [0, 0.2, 0.4, 0.6, 0.8, 1]

In [102]:
pd.get_dummies(pd.cut(values, bins))

   (0.0, 0.2]  (0.2, 0.4]  (0.4, 0.6]  (0.6, 0.8]  (0.8, 1.0]
0           0           0           0           0           1
1           0           1           0           0           0
2           1           0           0           0           0
3           0           1           0           0           0
4           0           0           1           0           0
5           0           0           1           0           0
6           0           0           0           0           1
7           0           0           0           1           0
8           0           0           0           1           0
9           0           0           0           1           0

## 7.3 String Manipulation

### String Object Methods

In [103]:
val = 'a, b, guido'

In [104]:
val.split(',')

['a', ' b', ' guido']

In [105]:
pieces = [x.strip() for x in val.split(',')]
pieces

['a', 'b', 'guido']

In [106]:
first, second, third = pieces

In [107]:
first + '::' + second + '::' + third

'a::b::guido'

In [108]:
'::'.join(pieces)

'a::b::guido'

In [109]:
'guido' in val

True

In [110]:
val.index(',')

1

In [111]:
val.find(':')

-1

In [112]:
# val.index(':')

In [113]:
val.count(',')

2

In [114]:
val.replace(',', '::')

'a:: b:: guido'

In [115]:
val.replace(',', '')

'a b guido'

| Argument | Description |
| - | - |
| count | Return the number of non-overlapping occurrences of substring in the string. |
| endswith | ReturnsTrueif string ends with suffix. |
| startswith | ReturnsTrueif string starts with prefix. |
| join | Use string as delimiter for concatenating a sequence of other strings. |
| index | Return position of first character in substring if found in the string; raises ValueError if not found. |
| find | Return position of first character of first occurrence of substring in the string; like index, but returns –1 if not found. |
| rfind | Return position of first character of last occurrence of substring in the string; returns –1 if not found. |
| replace | Replace occurrences of string with another string. |
| strip, rstrip, lstrip | Trim whitespace, including newlines; equivalent to x.strip() (and rstrip, lstrip, respectively) for each element. |
| split | Break string into list of substrings using passed delimiter. |
| lower | Convert alphabet characters to lowercase. |
| upper | Convert alphabet characters to uppercase. |
| casefold | Convert characters to lowercase, and convert any region-specific variable character combinations to a common comparable form. |
| ljust, rjust | Left justify or right justify, respectively; pad opposite side of string with spaces (or some other fill character) to return a string with a minimum width. |

### Regular Expressions

In [116]:
text = "foo bar\t baz \tqux"

In [117]:
re.split('\s+', text)

['foo', 'bar', 'baz', 'qux']

In [118]:
regex = re.compile('\s+')

In [119]:
regex.split(text)

['foo', 'bar', 'baz', 'qux']

In [120]:
regex.findall(text)

[' ', '\t ', ' \t']

In [121]:
text = """Dave dave@google.com
    Steve steve@gmail.com
    Rob rob@gmail.com
    Ryan ryan@yahoo.com
    """
pattern = r'[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,4}'
regex = re.compile(pattern, flags=re.IGNORECASE)

In [122]:
regex.findall(text)

['dave@google.com', 'steve@gmail.com', 'rob@gmail.com', 'ryan@yahoo.com']

In [123]:
m = regex.search(text)
m

In [124]:
text[m.start():m.end()]

'dave@google.com'

In [125]:
print(regex.match(text))

None

In [126]:
print(regex.sub('REDACTED', text))

Dave REDACTED
    Steve REDACTED
    Rob REDACTED
    Ryan REDACTED

In [127]:
pattern = r'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})'
regex = re.compile(pattern, flags=re.IGNORECASE)

In [128]:
m = regex.match('wesm@bright.net')

In [129]:
m.groups()

('wesm', 'bright', 'net')

In [130]:
regex.findall(text)

[('dave', 'google', 'com'),
 ('steve', 'gmail', 'com'),
 ('rob', 'gmail', 'com'),
 ('ryan', 'yahoo', 'com')]

In [131]:
print(regex.sub(r'Username: \1, Domain: \2, Suffix: \3', text))

Dave Username: dave, Domain: google, Suffix: com
    Steve Username: steve, Domain: gmail, Suffix: com
    Rob Username: rob, Domain: gmail, Suffix: com
    Ryan Username: ryan, Domain: yahoo, Suffix: com

##### Regular expression methods

| Argument | Description |
| - | - |
| findall | Return all non-overlapping matching patterns in a string as a list |
| finditer | Like findall, but returns an iterator |
| match | Match pattern at start of string and optionally segment pattern components into groups; if the pattern matches, returns a match object, and otherwise None |
| search | Scan string for match to pattern; returning a match object if so; unlike match, the match can be anywhere in the string as opposed to only at the beginning |
| split | Break string into pieces at each occurrence of pattern |
| sub, subn | Replace all (sub) or first n occurrences (subn) of pattern in string with replacement expression; use symbols \1, \2, ... to refer to match group elements in the replacement string |

### Vectorized String Functions in pandas

In [132]:
data = {'Dave': 'dave@google.com', 'Steve': 'steve@gmail.com',
        'Rob': 'rob@gmail.com', 'Wes': np.nan}

In [133]:
data = pd.Series(data)
data

Dave     dave@google.com
Steve    steve@gmail.com
Rob        rob@gmail.com
Wes                  NaN
dtype: object

In [134]:
data.isnull()

Dave     False
Steve    False
Rob      False
Wes       True
dtype: bool

In [135]:
data.str.contains('gmail')

Dave     False
Steve     True
Rob       True
Wes        NaN
dtype: object

In [136]:
pattern

'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\\.([A-Z]{2,4})'

In [137]:
data.str.findall(pattern, flags=re.IGNORECASE)

Dave     [(dave, google, com)]
Steve    [(steve, gmail, com)]
Rob        [(rob, gmail, com)]
Wes                        NaN
dtype: object

In [138]:
matches = data.str.match(pattern, flags=re.IGNORECASE)
matches

Dave     True
Steve    True
Rob      True
Wes       NaN
dtype: object

In [139]:
matches.str.get(1)

AttributeError: Can only use .str accessor with string values!

In [ ]:
matches.str[0]

In [ ]:
data.str[:5]

##### partial listing of vectorized string methods

| Method | Description |
| - | - |
| cat | Concatenate strings element-wise with optional delimiter |
| contains | Return boolean array if each string contains pattern/regex |
| count | Count occurrences of pattern |
| extract | Use a regular expression with groups to extract one or more strings from a Series of strings; the result will be a DataFrame with one column per group |
| endswith | Equivalent to x.endswith(pattern) for each element |
| startswith | Equivalent to x.startswith(pattern) for each element |
| findall | Compute list of all occurrences of pattern/regex for each string |
| get | Index into each element (retrieve i-th element) |
| isalnum | Equivalent to built-in str.alnum |
| isalpha | Equivalent to built-in str.isalpha |
| isdecimal | Equivalent to built-in str.isdecimal |
| isdigit | Equivalent to built-in str.isdigit |
| islower | Equivalent to built-in str.islower |
| isnumeric | Equivalent to built-in str.isnumeric |
| isupper | Equivalent to built-in str.isupper |
| join | Join strings in each element of the Series with passed separator |
| len | Compute length of each string |
| lower,upper | Convertcases;equivalent to x.lower() or x.upper() for each element |
| match | Use re.match with the passed regular expression on each element, returning matched groups as list |
| pad | Add whitespace to left, right, or both sides of strings |
| center | Equivalent topad(side='both') |
| repeat | Duplicate values (e.g., s.str.repeat(3) is equivalent to x * 3 for each string) |
| replace | Replace occurrences of pattern/regex with some other string |
| slice | Slice each string in the Series |
| split | Split strings on delimiter or regular expression |
| strip | Trim whitespace from both sides, including newlines |
| rstrip | Trim whitespace on right side |
| lstrip | Trim whitespace on left side |

## 7.4 Conclusion